# -*- coding: utf-8 -*-

# -------------------------------------------------------------------------------
# Name:         test
# Description:  
# Author:       guohuanyang
# Date:         2021/8/13
# Email         guohuanyang@datagrand.com
# -------------------------------------------------------------------------------


from fuzzywuzzy import fuzz
from fuzzywuzzy import process

x = process.extractOne('（4）发行人历史上作为外商投资企业实际经营期不满10年，是否按当时的法律法规补缴已免征、减征的企业所得税税款，发行人在变更为内资企业前是否存在外商投资、外汇管理、税收管理的情形',
                       ['是否按当时的法律法规补缴已免征、减征的企业所得税税款，发行人在变更为内资企业前是否存在外商投资、外汇管理、税收管理的情形',
                        '发行人历史上作为外商投资企业实际经营期不满10年，是否按当时的法律法规补缴已免征、减征的企业所得税税款，发行人在变更为内资企业前是否存在外商投资、外汇管理、税收管理的情形'], score_cutoff=90)
print(x)
